Revit 2026 API

# ConnectorIsConnectedTo Method

---

Identifies if the connector is connected to the specified connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsConnectedTo(
	Connector connector
)
```
```vb
Public Function IsConnectedTo (
	connector As Connector
) As Boolean
```
```cpp
public:
bool IsConnectedTo(
	Connector^ connector
)
```
```fsharp
member IsConnectedTo :
        connector : Connector -> bool
```

#### Parameters

connector Connector

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the argument is . |

#### Reference

Connector Class

Autodesk.Revit.DB Namespace